<!DOCTYPE html>
<html lang="ja" itemscope="" itemtype="http://schema.org/WebPage" dir="ltr">
  <head>
    <meta http-equiv="Content-Type" content="text/html; charset=utf-8">
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1, minimum-scale=1, maximum-scale=1, user-scalable=no">
    <meta name="keywords" content="ActiveTK,license">
    <title>利用規約 - 位置情報特定ツール</title>
    <meta name="robots" content="index">
    <style>a{color:#c71585;position:relative;display:inline-block}a,a:after{transition:.3s}a:after{position:absolute;bottom:0;left:50%;content:'';width:0;height:2px;background-color:#31aae2;transform:translateX(-50%)}a:hover:after{width:100%}</style>
  </head>
  <body style="background-color:#e6e6fa;color:#000000;">
    <div align="center">
      <h2>利用規約 - 位置情報特定ツール</h2>
	  <hr size="1" color="#7fffd4">
	  <div align="left" style="height:380px;width:100%;overflow-x:hidden;overflow-y:visible;">
        <div title="概要" style="background-color:#90ee90;">
          <h3>概要</h3>
          本サービス「位置情報特定ツール」は相手にリンクを踏ませる事でIPアドレスやGPS(位置情報)を取得する事の出来るツールです。
          <br>
          詐欺師対策にでも使ってください(GPSを扱ってみたかったので作りました。そしたらなんかYouTubeで宣伝されてて・・(ry)
          <br>
          本サービスを利用するにあたり、本ライセンス(別名「利用規約」)に全て同意する必要があります。
        </div>
	    <h3>1条 用語及び前提条件の定義</h3>
	    <p>1条第A項</p>
	    本サービス「位置情報特定ツール」(以下、本サービスと呼びます)を利用するにあたり、本ライセンスに全て同意する必要があります。
	    <br>
        なお、「本サービスを利用する」とは、本ウェブサイトへいずれかの端末を利用し、ネットワーク経由でアクセスし、リンク作成をし、「2」「3」の手順を実行する事を指すものとします。
        <br>
        本ライセンスに全て同意した方(以下、利用者様と呼びます)のみ本サービスの利用を許可します。本ライセンスに全て又は一部同意出来ない場合には速やかにタブを閉じてください。
	    <p>1条第B項</p>
	    本ライセンスは日本時間の2021年06月11日00時00分より適用されるものとします。
	    <p>1条第C項</p>
	    開発者は本ライセンスをいつでも改変/削除出来るものとします。
	    <br>
        なお、ライセンス変更後には再度利用者様がライセンスに全て同意する必要があります。
	    <h3>2条 サービスの内容</h3>
	    <p>2条第A項</p>
	    本サービスを利用すると、相手を生成されたURLにアクセスさせる事で、
        <pre>
        ・IPアドレス
        ・取得時間
        ・UserAgent(端末の情報)
        ・対応言語(言語情報)
        ・対応形式(MIME情報)
        ・Referer(アクセス元のURL)
        ・リダイレクト先
        (以下、位置情報の取得を許可している場合)
        ・緯度
        ・経度
        ・高度
        ・精度
        ・スピード
        (以下、JavaScriptの実行を許可している場合)
        ・ディスプレイ
        ・ブラウザの言語
        ・ブラウザの正式名称
        ・ディスプレイの色彩
        ・ネットワーク情報
        </pre>
        などの情報を取得する事が出来ます。
        <p>2条第B項</p>
        本サービスでは「アクセス拒否」されたような表示をする事で、位置情報の取得を許可する確立をあげています。
        <p>2条第C項</p>
        本サービスで取得する内容は、現在時刻を省き全てクライアント側で偽造する事が可能です。
        <br>
        その為、取得された情報が正確ではない可能性がありますが、ご了承ください。
        <h3>3条 責任</h3>
        <p>3条第A項</p>
        <font color="#ff0000">本サービスを利用した事によって発生した全ての問題/トラブル/エラーに関する責任に対し、自己の費用と責任をもってこれを解決するものとし、開発者及び開発関係者は一切の責任を負わないものとします。</font>
        <p>3条第B項</p>
        本サービスを悪用し、「損害賠償請求された！」などの問題が発生しても開発者及び開発関係者は一切の責任を負わないものとします。
        <br>
        全て自己責任でご利用ください。
        <p>3条第C項</p>
        本サービスによって何等かの問題が発生した場合に、利用者様に重大または故意の過失があった場合やその他開発者及び開発関係者が悪質と判断した場合には、利用者様にアクセス拒否等の手段で本サービスをご利用出来なくする可能性があります。
        <br>
        なお、本サービスご利用出来なくなった事によって発生した全ての問題/トラブル/エラーに対し、開発者及び開発関係者は一切の責任を負わないものとします。
        <p>3条第D項</p>
        3条第A項及び3条第B項の規定にもかかわらず開発者及び開発関係者が紛争に巻き込まれ、損害が発生した場合、開発元及び開発関係者は利用者様に対して損害賠償請求を行うことができるものとします。
        <p>3条第E項</p>
        本ライセンスは日本法に基づき解釈されるものとし、本サービスに関して訴訟の必要が生じた場合には東京地方裁判所を第一審の専属的合意管轄裁判所とします。
        <h3>4条 詳細</h3>
        <p>動作しない場合</p>
        動作しない場合、以下のいずれかの問題に該当するかもしれません。
        <br>
        以下の問題に該当しない場合や、よく分からない場合には<a href="mailto:webmaster@activetk.stars.ne.jp?subject=%E4%BD%8D%E7%BD%AE%E6%83%85%E5%A0%B1%E7%89%B9%E5%AE%9A%E3%83%84%E3%83%BC%E3%83%AB%E3%81%8C%E5%8B%95%E4%BD%9C%E3%81%97%E3%81%AA%E3%81%84&body=(%E5%86%85%E5%AE%B9%E3%82%92%E7%B0%A1%E6%BD%94%E3%81%AB%E5%85%A5%E5%8A%9B%E3%81%97%E3%81%A6%E3%81%8F%E3%81%A0%E3%81%95%E3%81%84)">開発者</a>へメールをお願い致します。
        <br>
        なお、返信出来かねる場合や返信に時間がかかる場合があります。ご了承ください。
        <p>Q. 2のリンクを踏むと、「お探しのページは見つかりませんでした」と表示されてしまう</p>
        正常に取得出来ています。
        <br>
        しかし、「リダイレクト先のURLを入力してください」の部分に正確なURLを貼り付けられていない可能性があります。
        <br>
        試しに以下のGoogle様のURLをコピぺしてみてください。
        <br>
        <a href="https://www.google.co.jp/">https://www.google.co.jp/</a>
        <p>Q. 「なんちゃらerror: (エラー内容) in /home/activetk/... on line なんちゃら」と表示される場合</p>
        サービスが正常に機能していません。修正されるまでお待ちください。なお、ご連絡をいただけると幸いです。
        <p>Q. 3のリンクを踏むと、「お探しのページは見つかりませんでした」と表示されてしまう</p>
        まだ相手がリンクを踏んでいない、又はロボット判定されて無視された場合に表示されます。
        <br>
        相手に再度リンクを踏ませてみてください。
      </div>
    </div>
    <hr size="1" color="#7fffd4">
    <div align="center"><font style="background-color:#06f5f3;">Copyright &copy; 2021 ActiveTK. All rights reserved.</font></div>
  </body>
</html>
